Masmiseim36/nxpSDK/boards/frdmk66f/demo_apps/bubble_peripheral/pin_mux.h
/*
 * The Clear BSD License
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/***********************************************************************************************************************

 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file

 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.

 **********************************************************************************************************************/



#ifndef _PIN_MUX_H_

#define _PIN_MUX_H_



/*!

 * @addtogroup pin_mux

 * @{

 */



/***********************************************************************************************************************

 * API

 **********************************************************************************************************************/



#if defined(__cplusplus)

extern "C" {

#endif



/*!

 * @brief Calls initialization functions.

 *

 */

void BOARD_InitBootPins(void);



#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */



/*! @name PORTB16 (coord E10), U7[4]/UART0_RX

  @{ */

#define BOARD_DEBUG_UART_RX_PORT PORTB /*!<@brief PORT device name: PORTB */

#define BOARD_DEBUG_UART_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */

                                       /* @} */



/*! @name PORTB17 (coord E9), U10[1]/UART0_TX

  @{ */

#define BOARD_DEBUG_UART_TX_PORT PORTB /*!<@brief PORT device name: PORTB */

#define BOARD_DEBUG_UART_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */

                                       /* @} */



/*!

 * @brief Configures pin routing and optionally pin electrical features.

 *

 */

void BOARD_InitPins(void);



#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */

#define PORT_DFER_DFE_9_MASK 0x0200u /*!<@brief Digital Filter Enable Mask for item 9. */



/*!

 * @brief Configures pin routing and optionally pin electrical features.

 *

 */

void BOARD_I2C_ConfigurePins(void);



/*! @name PORTD8 (coord C9), U8[4]/U19[11]/I2C0_SCL

  @{ */

#define BOARD_ACCEL_I2C_SCL_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */

#define BOARD_ACCEL_I2C_SCL_PORT PORTD /*!<@brief PORT device name: PORTD */

#define BOARD_ACCEL_I2C_SCL_PIN 8U     /*!<@brief PORTD pin index: 8 */

                                       /* @} */



/*! @name PORTD9 (coord B9), U8[6]/U19[12]/I2C0_SDA

  @{ */

#define BOARD_ACCEL_I2C_SDA_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */

#define BOARD_ACCEL_I2C_SDA_PORT PORTD /*!<@brief PORT device name: PORTD */

#define BOARD_ACCEL_I2C_SDA_PIN 9U     /*!<@brief PORTD pin index: 9 */

                                       /* @} */



/*!

 * @brief Configures pin routing and optionally pin electrical features.

 *

 */

void BOARD_Init_I2C_GPIO_pins(void);



#if defined(__cplusplus)

}

#endif



/*!

 * @}

 */

#endif /* _PIN_MUX_H_ */



/***********************************************************************************************************************

 * EOF

 **********************************************************************************************************************/

